#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/CrimLog/dev/runs/run-jFQZUsSyxEUZLuNN

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
aws_cloudwatch_log_group.log_group: Refreshing state... [id=/ecs/graphql-api-test]
data.aws_acm_certificate.cert: Refreshing...
aws_iam_policy.fargate_policy: Refreshing state... [id=arn:aws:iam::043894507808:policy/graphql-api-test-fargate-policy]
aws_vpc.vpc: Refreshing state... [id=vpc-0ee6fa0c508a5ca80]
aws_default_vpc.vpc: Refreshing state... [id=vpc-05493280cd154e867]
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=graphql-api-test-execution-role]
aws_ecs_cluster.cluster: Refreshing state... [id=arn:aws:ecs:us-east-1:043894507808:cluster/graphql-api-test]
aws_iam_role_policy_attachment.ecs-task-execution-role-policy-attachment2: Refreshing state... [id=graphql-api-test-execution-role-20230420170658951000000001]
aws_iam_role_policy_attachment.ecs-task-execution-role-policy-attachment1: Refreshing state... [id=graphql-api-test-execution-role-20230420170658980700000002]
aws_ecs_task_definition.definition: Refreshing state... [id=graphql-api-test-task]
data.aws_acm_certificate.cert: Refresh complete after 0s [id=arn:aws:acm:us-east-1:043894507808:certificate/bf306bea-c739-451e-bc54-bfd24909b37c]
aws_internet_gateway.gw: Refreshing state... [id=igw-03b3f72ff588c7b80]
aws_cloudwatch_log_group.log_group: Drift detected (update)
aws_ecs_task_definition.definition: Drift detected (update)
aws_iam_role.ecs_task_execution_role: Drift detected (update)
aws_iam_policy.fargate_policy: Drift detected (update)
aws_ecs_cluster.cluster: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.log_group must be replaced
-/+ resource "aws_cloudwatch_log_group" "log_group" {
      ~ arn               = "arn:aws:logs:us-east-1:043894507808:log-group:/ecs/graphql-api-test" -> (known after apply)
      ~ id                = "/ecs/graphql-api-test" -> (known after apply)
      ~ name              = "/ecs/graphql-api-test" -> "/ecs/graphql-api-dev" # forces replacement
      + name_prefix       = (known after apply)
      - tags              = {} -> null
      ~ tags_all          = {} -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_default_route_table.default will be created
  + resource "aws_default_route_table" "default" {
      + arn                    = (known after apply)
      + default_route_table_id = "rtb-02f716fd76bdb9cf4"
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + route                  = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "igw-03b3f72ff588c7b80"
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
          + {
              + cidr_block                 = "172.31.0.0/16"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = (known after apply)
            },
        ]
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

  # aws_default_security_group.default will be created
  + resource "aws_default_security_group" "default" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "172.33.0.0/16",
                ]
              + description      = "Default graphql-api-dev VPC"
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 5432
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "RDS-Postgres graphql-api-dev"
        }
      + tags_all               = {
          + "Name" = "RDS-Postgres graphql-api-dev"
        }
      + vpc_id                 = "vpc-0ee6fa0c508a5ca80"
    }

  # aws_ecs_cluster.cluster must be replaced
-/+ resource "aws_ecs_cluster" "cluster" {
      ~ arn                = "arn:aws:ecs:us-east-1:043894507808:cluster/graphql-api-test" -> (known after apply)
      ~ capacity_providers = [] -> (known after apply)
      ~ id                 = "arn:aws:ecs:us-east-1:043894507808:cluster/graphql-api-test" -> (known after apply)
      ~ name               = "graphql-api-test" -> "graphql-api-dev" # forces replacement
      - tags               = {} -> null
      ~ tags_all           = {} -> (known after apply)

        # (1 unchanged block hidden)
    }

  # aws_ecs_service.service will be created
  + resource "aws_ecs_service" "service" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = true
      + enable_execute_command             = false
      + health_check_grace_period_seconds  = 0
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "graphql-api-dev-svc"
      + platform_version                   = "LATEST"
      + propagate_tags                     = "NONE"
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + deployment_circuit_breaker {
          + enable   = false
          + rollback = false
        }

      + deployment_controller {
          + type = "ECS"
        }

      + load_balancer {
          + container_name   = "graphql-api-dev-container"
          + container_port   = 80
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = true
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }
    }

  # aws_ecs_task_definition.definition must be replaced
-/+ resource "aws_ecs_task_definition" "definition" {
      ~ arn                      = "arn:aws:ecs:us-east-1:043894507808:task-definition/graphql-api-test-task:1" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:043894507808:task-definition/graphql-api-test-task" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ environment      = [
                      ~ {
                            name  = "NODE_ENV"
                          ~ value = "test" -> "dev"
                        },
                        {
                            name  = "PORT"
                            value = "80"
                        },
                    ]
                  ~ image            = "043894507808.dkr.ecr.us-east-1.amazonaws.com/graphql-api:latest" -> "043894507808.dkr.ecr.us-east-1.amazonaws.com/graphql-api:03a81dd74225197aec5af253031968eec9007b2e"
                  ~ logConfiguration = {
                      ~ options   = {
                          ~ awslogs-group         = "/ecs/graphql-api-test" -> "/ecs/graphql-api-dev"
                            # (2 unchanged attributes hidden)
                        }
                        # (1 unchanged attribute hidden)
                    }
                  ~ name             = "graphql-api-test-container" -> "graphql-api-dev-container"
                  ~ secrets          = [
                      ~ {
                            name      = "JWT_SECRET"
                          ~ valueFrom = "arn:aws:secretsmanager:us-east-1:479401498383:secret:graphql-api-secrets-46UvoX:JWT_SECRET::" -> "arn:aws:secretsmanager:us-east-1:043894507808:secret:graphql-api-secrets-ajTuEN:JWT_SECRET::"
                        },
                      ~ {
                            name      = "DATABASE_URL"
                          ~ valueFrom = "arn:aws:secretsmanager:us-east-1:479401498383:secret:graphql-api-secrets-46UvoX:DATABASE_URL::" -> "arn:aws:secretsmanager:us-east-1:043894507808:secret:graphql-api-secrets-ajTuEN:DATABASE_URL::"
                        },
                      ~ {
                            name      = "ALCHEMY_API_KEY"
                          ~ valueFrom = "arn:aws:secretsmanager:us-east-1:479401498383:secret:graphql-api-secrets-46UvoX:ALCHEMY_API_KEY::" -> "arn:aws:secretsmanager:us-east-1:043894507808:secret:graphql-api-secrets-ajTuEN:ALCHEMY_API_KEY::"
                        },
                      ~ {
                            name      = "MATIC_PRIVATE_KEY"
                          ~ valueFrom = "arn:aws:secretsmanager:us-east-1:479401498383:secret:graphql-api-secrets-46UvoX:MATIC_PRIVATE_KEY::" -> "arn:aws:secretsmanager:us-east-1:043894507808:secret:graphql-api-secrets-ajTuEN:MATIC_PRIVATE_KEY::"
                        },
                    ]
                    # (5 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ execution_role_arn       = "arn:aws:iam::043894507808:role/graphql-api-test-execution-role" # forces replacement -> (known after apply)
      ~ family                   = "graphql-api-test-task" -> "graphql-api-dev-task" # forces replacement
      ~ id                       = "graphql-api-test-task" -> (known after apply)
      ~ revision                 = 1 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_iam_policy.fargate_policy must be replaced
-/+ resource "aws_iam_policy" "fargate_policy" {
      ~ arn         = "arn:aws:iam::043894507808:policy/graphql-api-test-fargate-policy" -> (known after apply)
      ~ id          = "arn:aws:iam::043894507808:policy/graphql-api-test-fargate-policy" -> (known after apply)
      ~ name        = "graphql-api-test-fargate-policy" -> "graphql-api-dev-fargate-policy" # forces replacement
      + name_prefix = (known after apply)
      ~ policy_id   = "ANPAQUOCRBEQFIOU4CLJ7" -> (known after apply)
      - tags        = {} -> null
      ~ tags_all    = {} -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_iam_role.ecs_task_execution_role must be replaced
-/+ resource "aws_iam_role" "ecs_task_execution_role" {
      ~ arn                   = "arn:aws:iam::043894507808:role/graphql-api-test-execution-role" -> (known after apply)
      ~ create_date           = "2023-04-20T17:06:58Z" -> (known after apply)
      ~ id                    = "graphql-api-test-execution-role" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::043894507808:policy/graphql-api-test-fargate-policy",
          - "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy",
        ] -> (known after apply)
      ~ name                  = "graphql-api-test-execution-role" -> "graphql-api-dev-execution-role" # forces replacement
      + name_prefix           = (known after apply)
      - tags                  = {} -> null
      ~ tags_all              = {} -> (known after apply)
      ~ unique_id             = "AROAQUOCRBEQGPSU7GEUG" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_iam_role_policy_attachment.ecs-task-execution-role-policy-attachment1 must be replaced
-/+ resource "aws_iam_role_policy_attachment" "ecs-task-execution-role-policy-attachment1" {
      ~ id         = "graphql-api-test-execution-role-20230420170658980700000002" -> (known after apply)
      ~ role       = "graphql-api-test-execution-role" -> "graphql-api-dev-execution-role" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role_policy_attachment.ecs-task-execution-role-policy-attachment2 must be replaced
-/+ resource "aws_iam_role_policy_attachment" "ecs-task-execution-role-policy-attachment2" {
      ~ id         = "graphql-api-test-execution-role-20230420170658951000000001" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::043894507808:policy/graphql-api-test-fargate-policy" # forces replacement -> (known after apply)
      ~ role       = "graphql-api-test-execution-role" -> "graphql-api-dev-execution-role" # forces replacement
    }

  # aws_lb.alb will be created
  + resource "aws_lb" "alb" {
      + arn                                         = (known after apply)
      + arn_suffix                                  = (known after apply)
      + desync_mitigation_mode                      = "defensive"
      + dns_name                                    = (known after apply)
      + drop_invalid_header_fields                  = false
      + enable_deletion_protection                  = false
      + enable_http2                                = true
      + enable_tls_version_and_cipher_suite_headers = false
      + enable_waf_fail_open                        = false
      + enable_xff_client_port                      = false
      + id                                          = (known after apply)
      + idle_timeout                                = 60
      + internal                                    = false
      + ip_address_type                             = "ipv4"
      + load_balancer_type                          = "application"
      + name                                        = "graphql-api-dev-alb"
      + preserve_host_header                        = false
      + security_groups                             = (known after apply)
      + subnets                                     = (known after apply)
      + tags_all                                    = (known after apply)
      + vpc_id                                      = (known after apply)
      + xff_header_processing_mode                  = "append"
      + zone_id                                     = (known after apply)
    }

  # aws_lb_listener.listener will be created
  + resource "aws_lb_listener" "listener" {
      + arn               = (known after apply)
      + certificate_arn   = "arn:aws:acm:us-east-1:043894507808:certificate/bf306bea-c739-451e-bc54-bfd24909b37c"
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 443
      + protocol          = "HTTPS"
      + ssl_policy        = "ELBSecurityPolicy-2016-08"
      + tags_all          = (known after apply)

      + default_action {
          + order            = 1
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_target_group.target_group will be created
  + resource "aws_lb_target_group" "target_group" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = "ipv4"
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = "round_robin"
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "graphql-api-dev"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = "HTTP1"
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "ip"
      + vpc_id                             = "vpc-0ee6fa0c508a5ca80"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 60
          + matcher             = "200"
          + path                = "/health"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 2
        }

      + stickiness {
          + cookie_duration = 86400
          + enabled         = false
          + type            = "lb_cookie"
        }
    }

  # aws_route.vpc_peering_route will be created
  + resource "aws_route" "vpc_peering_route" {
      + destination_cidr_block    = "172.33.0.0/16"
      + id                        = (known after apply)
      + instance_id               = (known after apply)
      + instance_owner_id         = (known after apply)
      + network_interface_id      = (known after apply)
      + origin                    = (known after apply)
      + route_table_id            = "rtb-028683c282ba5ed8c"
      + state                     = (known after apply)
      + vpc_peering_connection_id = (known after apply)
    }

  # aws_security_group.graphql_api will be created
  + resource "aws_security_group" "graphql_api" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "graphql-api-dev"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-0ee6fa0c508a5ca80"
    }

  # aws_security_group.web_everyone2 will be created
  + resource "aws_security_group" "web_everyone2" {
      + arn                    = (known after apply)
      + description            = "Allow web traffic from everyone"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "web-everyone2"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "web-everyone2"
        }
      + tags_all               = {
          + "Name" = "web-everyone2"
        }
      + vpc_id                 = "vpc-0ee6fa0c508a5ca80"
    }

  # aws_subnet.subnet["us-east-1b"] will be created
  + resource "aws_subnet" "subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.33.0.0/18"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = "ip-name"
      + tags_all                                       = (known after apply)
      + vpc_id                                         = "vpc-0ee6fa0c508a5ca80"
    }

  # aws_subnet.subnet["us-east-1d"] will be created
  + resource "aws_subnet" "subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1d"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.33.64.0/18"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = "ip-name"
      + tags_all                                       = (known after apply)
      + vpc_id                                         = "vpc-0ee6fa0c508a5ca80"
    }

  # aws_vpc_peering_connection.peering_connection will be created
  + resource "aws_vpc_peering_connection" "peering_connection" {
      + accept_status = (known after apply)
      + auto_accept   = true
      + id            = (known after apply)
      + peer_owner_id = (known after apply)
      + peer_region   = (known after apply)
      + peer_vpc_id   = "vpc-05493280cd154e867"
      + tags          = {
          + "Name" = "VPC Peering between main vpc and graphql-api-dev"
        }
      + tags_all      = {
          + "Name" = "VPC Peering between main vpc and graphql-api-dev"
        }
      + vpc_id        = "vpc-0ee6fa0c508a5ca80"

      + accepter {
          + allow_classic_link_to_remote_vpc = false
          + allow_remote_vpc_dns_resolution  = true
          + allow_vpc_to_remote_classic_link = false
        }

      + requester {
          + allow_classic_link_to_remote_vpc = false
          + allow_remote_vpc_dns_resolution  = true
          + allow_vpc_to_remote_classic_link = false
        }
    }

Plan: 19 to add, 0 to change, 7 to destroy.

```

</details>

*Pushed by: @renovate[bot], Action: `pull_request`, Environment: `dev`*